In [1]:
import glob
import pandas as pd
import numpy as np

In [2]:
# read user files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/usagers*.csv"):
    files.append(file)

# import user files
users = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',')
    if i == 0:
        users = file
    else:
        users = pd.concat([users, file], axis = 0)

# export csv
users.to_csv("./data/users.csv", sep = ',', header = True, na_rep = 'n/a', index=False)
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2509620 entries, 0 to 197497
Data columns (total 16 columns):
 #   Column       Dtype
---  ------       -----
 0   Num_Acc      int64
 1   id_vehicule  object
 2   num_veh      object
 3   place        float64
 4   catu         int64
 5   grav         int64
 6   sexe         int64
 7   an_nais      float64
 8   trajet       float64
 9   secu1        float64
 10  secu2        float64
 11  secu3        float64
 12  locp         float64
 13  actp         object
 14  etatp        float64
 15  secu         float64
dtypes: float64(9), int64(4), object(3)
memory usage: 325.5+ MB

In [3]:
users.head()

,Num_Acc,id_vehicule,num_veh,place,catu,grav,sexe,an_nais,trajet,secu1,secu2,secu3,locp,actp,etatp,secu
0,201900000001,138 306 524,B01,2.0,2,4,2,2002.0,0.0,1.0,0.0,-1.0,-1.0,-1,-1.0,NaN
1,201900000001,138 306 524,B01,1.0,1,4,2,1993.0,5.0,1.0,0.0,-1.0,-1.0,-1,-1.0,NaN
2,201900000001,138 306 525,A01,1.0,1,1,1,1959.0,0.0,1.0,0.0,-1.0,-1.0,-1,-1.0,NaN
3,201900000002,138 306 523,A01,1.0,1,4,2,1994.0,0.0,1.0,0.0,-1.0,-1.0,-1,-1.0,NaN
4,201900000003,138 306 520,A01,1.0,1,1,1,1996.0,0.0,1.0,0.0,-1.0,-1.0,0,-1.0,NaN

In [4]:
# read characteristics (=features) files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/caracter*.csv"):
    files.append(file)

# import user files
features = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', encoding='latin-1', na_values=['N/A', 'n/a',''])
    if i == 0:
        features = file
    else:
        features = pd.concat([features, file], axis = 0)

# export csv
features.to_csv("./data/features.csv", sep = ',', header = True, na_rep = 'n/a', index=False)
features.info()

<class 'pandas.core.frame.DataFrame'>
Index: 982060 entries, 0 to 58396
Data columns (total 16 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   Num_Acc  982060 non-null  int64
 1   an       982060 non-null  int64
 2   mois     982060 non-null  int64
 3   jour     982060 non-null  int64
 4   hrmn     982060 non-null  object
 5   lum      982060 non-null  int64
 6   agg      982060 non-null  int64
 7   int      982060 non-null  int64
 8   atm      981987 non-null  float64
 9   col      982041 non-null  float64
 10  com      982058 non-null  object
 11  adr      850489 non-null  object
 12  gps      455722 non-null  object
 13  lat      553725 non-null  object
 14  long     553721 non-null  object
 15  dep      982060 non-null  object
dtypes: float64(2), int64(7), object(7)
memory usage: 127.4+ MB

In [5]:
# read places files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/lieux*.csv"):
    files.append(file)

# import user files
places = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', encoding='latin-1', na_values=['N/A', 'n/a',''], low_memory=False)
    if i == 0:
        places = file
    else:
        places = pd.concat([features, file], axis = 0)

# export csv
places.to_csv("./data/places.csv", sep = ',', header = True, na_rep = 'N/A', index=False)
places.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1069086 entries, 0 to 87025
Data columns (total 33 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   Num_Acc  1069086 non-null  int64
 1   an       982060 non-null   float64
 2   mois     982060 non-null   float64
 3   jour     982060 non-null   float64
 4   hrmn     982060 non-null   object
 5   lum      982060 non-null   float64
 6   agg      982060 non-null   float64
 7   int      982060 non-null   float64
 8   atm      981987 non-null   float64
 9   col      982041 non-null   float64
 10  com      982058 non-null   object
 11  adr      850489 non-null   object
 12  gps      455722 non-null   object
 13  lat      553725 non-null   object
 14  long     553721 non-null   object
 15  dep      982060 non-null   object
 16  catr     87025 non-null    float64
 17  voie     79497 non-null    float64
 18  v1       86821 non-null    float64
 19  v2       2136 non-null     object
 20  circ     87026 non-null    float64
 21  nbv      87026 non-null    float64
 22  pr       47515 non-null    float64
 23  pr1      47515 non-null    float64
 24  vosp     87026 non-null    float64
 25  prof     87026 non-null    float64
 26  plan     87026 non-null    float64
 27  lartpc   87026 non-null    float64
 28  larrout  87026 non-null    float64
 29  surf     87026 non-null    float64
 30  infra    87026 non-null    float64
 31  situ     87026 non-null    float64
 32  env1     87026 non-null    float64
dtypes: float64(24), int64(1), object(8)
memory usage: 277.3+ MB

In [6]:
# read vehicle files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/vehicules*.csv"):
    files.append(file)

# import user files
vehicles = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', encoding='latin-1', na_values=['N/A', 'n/a',''], low_memory=False)
    if i == 0:
        vehicles = file
    else:
        vehicles = pd.concat([vehicles, file], axis = 0)

# export csv
vehicles.to_csv("./data/vehicles.csv", sep = ',', header = True, na_rep = 'N/A', index=False)
vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1914902 entries, 0 to 131047
Data columns (total 11 columns):
 #   Column       Dtype
---  ------       -----
 0   Num_Acc      int64
 1   senc         float64
 2   catv         int64
 3   occutc       float64
 4   obs          float64
 5   obsm         float64
 6   choc         float64
 7   manv         float64
 8   num_veh      object
 9   id_vehicule  object
 10  motor        float64
dtypes: float64(7), int64(2), object(2)
memory usage: 175.3+ MB

In [7]:
vehicles.head()

,Num_Acc,senc,catv,occutc,obs,obsm,choc,manv,num_veh,id_vehicule,motor
0,200500000001,0.0,7,0.0,0.0,2.0,1.0,1.0,A01,NaN,NaN
1,200500000001,0.0,7,0.0,0.0,2.0,8.0,10.0,B02,NaN,NaN
2,200500000002,0.0,7,0.0,0.0,2.0,7.0,16.0,A01,NaN,NaN
3,200500000002,0.0,2,0.0,0.0,2.0,1.0,1.0,B02,NaN,NaN
4,200500000003,0.0,2,0.0,0.0,2.0,1.0,1.0,A01,NaN,NaN

In [8]:
# read registered vehicle files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/registered_vehicles*.csv"):
    files.append(file)

# import user files
vehicles = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ';', na_values=['N/A', 'n/a',''], low_memory=False, encoding="UTF-8")
    if i == 0:
        vehicles = file
    else:
        vehicles = pd.concat([vehicles, file], axis = 0)

vehicles.head()

,Id_accident,Lettre Conventionnelle Véhicule,Année,Lieu Admin Actuel - Territoire Nom,Type Accident - Libellé,CNIT,Catégorie véhicule,Age véhicule,Type Accident - Libellé (old)
0,900 493,A,2014,DOM,Accident Léger,VF7MFDJYF651296,VT,NaN,NaN
1,900 493,B,2014,DOM,Accident Léger,NaN,Cyclo,NaN,NaN
2,900 494,A,2014,DOM,Accident grave non mortel,NaN,VT,4.0,NaN
3,900 495,A,2014,DOM,Accident grave non mortel,LMP21C10N026,Cyclo,7.0,NaN
4,900 496,A,2014,DOM,Accident grave non mortel,LSY91C10U174,Cyclo,6.0,NaN

In [9]:
vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1200791 entries, 0 to 74663
Data columns (total 9 columns):
 #   Column                              Non-Null Count    Dtype
---  ------                              --------------    -----
 0   Id_accident                         1200791 non-null  object
 1   Lettre Conventionnelle Véhicule     1200790 non-null  object
 2   Année                               1200791 non-null  int64
 3   Lieu Admin Actuel - Territoire Nom  1200791 non-null  object
 4   Type Accident - Libellé             1078193 non-null  object
 5   CNIT                                776011 non-null   object
 6   Catégorie véhicule                  1200791 non-null  object
 7   Age véhicule                        1096605 non-null  object
 8   Type Accident - Libellé (old)       122598 non-null   object
dtypes: int64(1), object(8)
memory usage: 91.6+ MB

In [10]:
# data wrangling
# Id_accident contains whitespace, needs to be removed

vehicles['Id_accident'] = vehicles['Id_accident'].replace(" ", "")

In [11]:
vehicles['Id_accident']

0           900 493
1           900 493
2           900 494
3           900 495
4           900 496
            ...
74659    66 554 980
74660    66 554 980
74661    66 554 981
74662    66 554 982
74663    66 554 982
Name: Id_accident, Length: 1200791, dtype: object

In [12]:
# The whitespace is not removed. Very strange.
# Let's check the string:
vehicles.iloc[0].Id_accident

'900\xa0493'

In [13]:
vehicles.iloc[74659].Id_accident

'946\xa0769'

In [14]:
# well, this is unbreakable space...
# strange encoding..
# found this https://stackoverflow.com/questions/10993612/how-to-remove-xa0-from-string-in-python

In [15]:
new_id = list()
for i in range(0, len(vehicles)):
    new_id.append(vehicles.iloc[i].Id_accident.replace('\xa0', ''))

In [16]:
# Replace
vehicles.Id_accident = new_id

# new_id is still string, so let's change:
vehicles = vehicles.astype({"Id_accident":"int"})

In [17]:
vehicles.head()

,Id_accident,Lettre Conventionnelle Véhicule,Année,Lieu Admin Actuel - Territoire Nom,Type Accident - Libellé,CNIT,Catégorie véhicule,Age véhicule,Type Accident - Libellé (old)
0,900493,A,2014,DOM,Accident Léger,VF7MFDJYF651296,VT,NaN,NaN
1,900493,B,2014,DOM,Accident Léger,NaN,Cyclo,NaN,NaN
2,900494,A,2014,DOM,Accident grave non mortel,NaN,VT,4.0,NaN
3,900495,A,2014,DOM,Accident grave non mortel,LMP21C10N026,Cyclo,7.0,NaN
4,900496,A,2014,DOM,Accident grave non mortel,LSY91C10U174,Cyclo,6.0,NaN

In [18]:
vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1200791 entries, 0 to 74663
Data columns (total 9 columns):
 #   Column                              Non-Null Count    Dtype
---  ------                              --------------    -----
 0   Id_accident                         1200791 non-null  int64
 1   Lettre Conventionnelle Véhicule     1200790 non-null  object
 2   Année                               1200791 non-null  int64
 3   Lieu Admin Actuel - Territoire Nom  1200791 non-null  object
 4   Type Accident - Libellé             1078193 non-null  object
 5   CNIT                                776011 non-null   object
 6   Catégorie véhicule                  1200791 non-null  object
 7   Age véhicule                        1096605 non-null  object
 8   Type Accident - Libellé (old)       122598 non-null   object
dtypes: int64(2), object(7)
memory usage: 91.6+ MB

In [19]:
# export csv
vehicles.to_csv("./data/registered_vehicles.csv", sep = ',', header = True, na_rep = 'N/A', index=False)

## Update 11 June 2023
I realised that users has a similar field, I just convert this additionally1

In [20]:
users.iloc[0].id_vehicule

'138\xa0306\xa0524'

In [21]:
users.head()

,Num_Acc,id_vehicule,num_veh,place,catu,grav,sexe,an_nais,trajet,secu1,secu2,secu3,locp,actp,etatp,secu
0,201900000001,138 306 524,B01,2.0,2,4,2,2002.0,0.0,1.0,0.0,-1.0,-1.0,-1,-1.0,NaN
1,201900000001,138 306 524,B01,1.0,1,4,2,1993.0,5.0,1.0,0.0,-1.0,-1.0,-1,-1.0,NaN
2,201900000001,138 306 525,A01,1.0,1,1,1,1959.0,0.0,1.0,0.0,-1.0,-1.0,-1,-1.0,NaN
3,201900000002,138 306 523,A01,1.0,1,4,2,1994.0,0.0,1.0,0.0,-1.0,-1.0,-1,-1.0,NaN
4,201900000003,138 306 520,A01,1.0,1,1,1,1996.0,0.0,1.0,0.0,-1.0,-1.0,0,-1.0,NaN

So, same procedure as above:

In [25]:
# In the column exist nas, so a little different processing
new_id_users = list()
for i in range(0, len(users)):
    if type(users.iloc[i].id_vehicule) == str:
        new_id_users.append(users.iloc[i].id_vehicule.replace('\xa0', ''))
    elif np.isnan(users.iloc[i].id_vehicule) == True:
        new_id_users.append()

In [33]:
# Replace
users.id_vehicule = new_id_users

# new_id is still string, so let's change:
users.id_vehicule = users['id_vehicule'].astype('Int64')
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2509620 entries, 0 to 197497
Data columns (total 16 columns):
 #   Column       Dtype
---  ------       -----
 0   Num_Acc      int64
 1   id_vehicule  Int64
 2   num_veh      object
 3   place        float64
 4   catu         int64
 5   grav         int64
 6   sexe         int64
 7   an_nais      float64
 8   trajet       float64
 9   secu1        float64
 10  secu2        float64
 11  secu3        float64
 12  locp         float64
 13  actp         object
 14  etatp        float64
 15  secu         float64
dtypes: Int64(1), float64(9), int64(4), object(2)
memory usage: 327.9+ MB

In [34]:
# export csv
users.to_csv("./data/users.csv", sep = ',', header = True, na_rep = 'n/a', index=False)